Router Configurations
===============================================================================

Up the Interfaces
-----------------------------------------------
Router(config)#hostname F1-Router

F1-Router(config)#int se0/2/0
F1-Router(config-if)#ip add 10.10.10.5 255.255.255.252
F1-Router(config-if)#no shut
F1-Router(config-if)#ex

F1-Router(config)#int se0/2/1
F1-Router(config-if)#ip add 10.10.10.9 255.255.255.252
F1-Router(config-if)#no shut
F1-Router(config-if)#ex

Create Sub-interfaces and Inter-VLAN
--------------------------------------------------
F1-Router(config)#int gig0/0
F1-Router(config-if)#no shut
F1-Router(config-if)#ex

F1-Router(config)#int gig0/0.80
F1-Router(config-subif)#encapsulation dot1Q 80
F1-Router(config-subif)#ip add 192.168.8.1 255.255.255.0
F1-Router(config-subif)#no shut
F1-Router(config-subif)#exit

F1-Router(config)#int gig0/0.70
F1-Router(config-subif)#encapsulation dot1Q 70
F1-Router(config-subif)#ip add 192.168.7.1 255.255.255.0
F1-Router(config-subif)#no shut
F1-Router(config-subif)#exit

F1-Router(config)#int gig0/0.60
F1-Router(config-subif)#encapsulation dot1Q 60
F1-Router(config-subif)#ip add 192.168.6.1 255.255.255.0
F1-Router(config-subif)#no shut
F1-Router(config-subif)#exit

DHCP Configurations
--------------------------------------------------
F1-Router(config)#service dhcp

F1-Router(config)#ip dhcp pool Reception
F1-Router(dhcp-config)#network 192.168.8.0 255.255.255.0
F1-Router(dhcp-config)#default-router 192.168.8.1
F1-Router(dhcp-config)#dns-server 192.168.8.1
F1-Router(dhcp-config)#ex

F1-Router(config)#ip dhcp pool Store
F1-Router(dhcp-config)#network 192.168.7.0 255.255.255.0
F1-Router(dhcp-config)#default-router 192.168.7.1
F1-Router(dhcp-config)#dns-server 192.168.7.1
F1-Router(dhcp-config)#ex

F1-Router(config)#ip dhcp pool Logistics
F1-Router(dhcp-config)#network 192.168.6.0 255.255.255.0
F1-Router(dhcp-config)#default-router 192.168.6.1
F1-Router(dhcp-config)#dns-server 192.168.6.1
F1-Router(dhcp-config)#ex

OSPF Routing
--------------------------------------------------
F1-Router(config)#router ospf 10
F1-Router(config-router)#router-id 1.1.1.1
F1-Router(config-router)#network 10.10.10.4 0.0.0.3 area 0
F1-Router(config-router)#network 10.10.10.8 0.0.0.3 area 0
F1-Router(config-router)#network 192.168.8.0 0.0.0.255 area 0
F1-Router(config-router)#network 192.168.7.0 0.0.0.255 area 0
F1-Router(config-router)#network 192.168.6.0 0.0.0.255 area 0
F1-Router(config-router)#passive-interface gigabitEthernet 0/0
F1-Router(config-router)#ex

SSH 
--------------------------------------------------
F1-Router(config)#ip domain-name Hotel.lk
F1-Router(config)#username hotel password hotel@123
F1-Router(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
F1-Router(config)#line vty 0 15
F1-Router(config-line)#login local 
F1-Router(config-line)#transport input ssh 
F1-Router(config-line)#do wr
--------------------------------------------------------------------------------

Up the Interfaces
-----------------------------------------------
Router(config)#hostname F2-Router

F2-Router(config)#int se0/1/0
F2-Router(config-if)#ip add 10.10.10.1 255.255.255.252
F2-Router(config-if)#no shut
F2-Router(config-if)#ex

F2-Router(config)#int se0/1/1
F2-Router(config-if)#no shut
F2-Router(config-if)#ip add 10.10.10.10 255.255.255.252
F2-Router(config-if)#clock rate 64000
F2-Router(config-if)#ex

Create Sub-interfaces and Inter-VLAN
--------------------------------------------------
F1-Router(config)#int gig0/0
F1-Router(config-if)#no shut
F1-Router(config-if)#ex

F2-Router(config)#int gig0/0.30
F2-Router(config-subif)#encapsulation dot1Q 30
F2-Router(config-subif)#ip add 192.168.3.1 255.255.255.0
F2-Router(config-subif)#ex

F2-Router(config)#int gig0/0.40
F2-Router(config-subif)#encapsulation dot1Q 40
F2-Router(config-subif)#ip add 192.168.4.1 255.255.255.0
F2-Router(config-subif)#ex

F2-Router(config)#int gig0/0.50
F2-Router(config-subif)#encapsulation dot1Q 50
F2-Router(config-subif)#ip add 192.168.5.1 255.255.255.0
F2-Router(config-subif)#ex

DHCP Configurations
--------------------------------------------------
F2-Router(config)#service dhcp

F2-Router(config)#ip dhcp pool Sales
F2-Router(dhcp-config)#network 192.168.3.0 255.255.255.0
F2-Router(dhcp-config)#default-router 192.168.3.1
F2-Router(dhcp-config)#dns-server 192.168.3.1
F2-Router(dhcp-config)#ex

F2-Router(config)#ip dhcp pool HR
F2-Router(dhcp-config)#network 192.168.4.0 255.255.255.0
F2-Router(dhcp-config)#default-router 192.168.4.1
F2-Router(dhcp-config)#dns-server 192.168.4.1
F2-Router(dhcp-config)#ex

F2-Router(config)#ip dhcp pool Finance
F2-Router(dhcp-config)#network 192.168.5.0 255.255.255.0
F2-Router(dhcp-config)#default-router 192.168.5.1
F2-Router(dhcp-config)#dns-server 192.168.5.1
F2-Router(dhcp-config)#ex

OSPF Routing
--------------------------------------------------
F2-Router(config)#router ospf 10
F2-Router(config-router)#router-id 2.2.2.2
F2-Router(config-router)#network 10.10.10.0 0.0.0.3 area 0
F2-Router(config-router)#network 10.10.10.8 0.0.0.3 area 0
F2-Router(config-router)#network 192.168.3.0 0.0.0.255 area 0
F2-Router(config-router)#network 192.168.4.0 0.0.0.255 area 0
F2-Router(config-router)#network 192.168.5.0 0.0.0.255 area 0
F2-Router(config-router)#passive-interface gigabitEthernet 0/0
F2-Router(config-router)#ex

SSH 
--------------------------------------------------
F2-Router(config)#ip domain-name Hotel.lk
F2-Router(config)#username hotel password hotel@123
F2-Router(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
F2-Router(config)#line vty 0 15
F2-Router(config-line)#login local 
F2-Router(config-line)#transport input ssh 
F2-Router(config-line)#do wr
--------------------------------------------------------------------------------

Up the Interfaces
-----------------------------------------------
Router(config)#hostname F3-Router

F3-Router(config)#int se0/2/0
F3-Router(config-if)#ip add 10.10.10.6 255.255.255.252
F3-Router(config-if)#clock rate 64000
F3-Router(config-if)#no shut
F3-Router(config-if)#ex

F3-Router(config)#int se0/2/1
F3-Router(config-if)#ip add 10.10.10.2 255.255.255.252
F3-Router(config-if)#clock rate 64000
F3-Router(config-if)#no shut
F3-Router(config-if)#ex

Create Sub-interfaces and Inter-VLAN
--------------------------------------------------
F3-Router(config)#int gig0/0
F3-Router(config-if)#no shut
F3-Router(config-if)#ex

F3-Router(config)#int gig0/0.10
F3-Router(config-subif)#encapsulation dot1Q 10
F3-Router(config-subif)#ip add 192.168.1.1 255.255.255.0
F3-Router(config-subif)#ex

F3-Router(config)#int gig0/0.20
F3-Router(config-subif)#encapsulation dot1Q 20
F3-Router(config-subif)#ip add 192.168.2.1 255.255.255.0
F3-Router(config-subif)#ex

DHCP Configurations
--------------------------------------------------
F3-Router(config)#service dhcp

F3-Router(config)#ip dhcp pool IT
F3-Router(dhcp-config)#network 192.168.1.0 255.255.255.0
F3-Router(dhcp-config)#default-router 192.168.1.1
F3-Router(dhcp-config)#dns-server 192.168.1.1
F3-Router(dhcp-config)#ex

F3-Router(config)#ip dhcp pool Admin
F3-Router(dhcp-config)#network 192.168.2.0 255.255.255.0
F3-Router(dhcp-config)#default-router 192.168.2.1
F3-Router(dhcp-config)#dns-server 192.168.2.1
F3-Router(dhcp-config)#ex

OSPF Routing
--------------------------------------------------
F3-Router(config)#router ospf 10
F3-Router(config-router)#router-id 3.3.3.3
F3-Router(config-router)#network 10.10.10.0 0.0.0.3 area 0
F3-Router(config-router)#network 10.10.10.4 0.0.0.3 area 0
F3-Router(config-router)#network 192.168.1.0 0.0.0.255 area 0
F3-Router(config-router)#network 192.168.2.0 0.0.0.255 area 0
F3-Router(config-router)#passive-interface gigabitEthernet 0/0
F3-Router(config-router)#ex

SSH 
--------------------------------------------------
F3-Router(config)#ip domain-name Hotel.lk
F3-Router(config)#username hotel password hotel@123
F3-Router(config)#crypto key generate rsa
How many bits in the modulus [512]: 1024
F3-Router(config)#line vty 0 15
F3-Router(config-line)#login local 
F3-Router(config-line)#transport input ssh 
F3-Router(config-line)#do wr




